Core Template MRF/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0495;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    walls
    {
        type            inletOutlet;
        inletValue      uniform 0.0495;
        value           uniform 0.0495;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.0495;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0495;
        value           uniform 0.0495;
    }
    propellerTip
    {
        type            epsilonWallFunction;
        value           uniform 0.0495;
    }
    nonCouple1
    {
        type            zeroGradient;
    }
    nonCouple2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
