Core Template MRF/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.06;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    walls
    {
        type            inletOutlet;
        inletValue      uniform 0.06;
        value           uniform 0.06;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.06;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.06;
        value           uniform 0.06;
    }
    propellerTip
    {
        type            kqRWallFunction;
        value           uniform 0.06;
    }
    nonCouple1
    {
        type            zeroGradient;
    }
    nonCouple2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
