Core Template MRF/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../Parameters/decomposeParDict_parameters.cpp"

numberOfSubdomains $numberOfSubdomains;

method          $method;

// ************************************************************************* //
