Core Template MRF/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
//    div(phi,U)      Gauss upwind;
    div(phi,U)      Gauss linearUpwind grad(U);
    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(phi,omega) Gauss linear;
    div(phi,nuTilda) Gauss linear;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phiv,p) Gauss linear;
    div(phi,K) Gauss linear;
    div(phi,e) Gauss linear;
    div(meshPhi,p) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.33;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
