Core Template MRF/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "propellerTip.stl"
    "innerCylinder.stl"
    "outerCylinder.stl"
);

includedAngle 150;



